Infineon/cce-mtb-psoc6-bt-a2dp-source/source/source_bluetooth/a2dp_source.c
/******************************************************************************
* File Name:   a2dp_source.c
*
* Description: Source file for A2DP source task.
*
*******************************************************************************
* Copyright 2023, Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.  All rights reserved.
*
* This software, including source code, documentation and related
* materials ("Software") is owned by Cypress Semiconductor Corporation
* or one of its affiliates ("Cypress") and is protected by and subject to
* worldwide patent protection (United States and foreign),
* United States copyright laws and international treaty provisions.
* Therefore, you may use this Software only as provided in the license
* agreement accompanying the software package from which you
* obtained this Software ("EULA").
* If no EULA applies, Cypress hereby grants you a personal, non-exclusive,
* non-transferable license to copy, modify, and compile the Software
* source code solely for use in connection with Cypress's
* integrated circuit products.  Any reproduction, modification, translation,
* compilation, or representation of this Software except as specified
* above is prohibited without the express written permission of Cypress.
*
* Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
* EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
* reserves the right to make changes to the Software without notice. Cypress
* does not assume any liability arising out of the application or use of the
* Software or any product or circuit described in the Software. Cypress does
* not authorize its products for use in any products where a malfunction or
* failure of the Cypress product may reasonably be expected to result in
* significant property damage, injury or death ("High Risk Product"). By
* including Cypress's product in a High Risk Product, the manufacturer
* of such system or application assumes all risk of such use and in doing
* so agrees to indemnify Cypress against all liability.
*******************************************************************************/

/******************************************************************************
 * Includes
 *****************************************************************************/

#ifdef  WICED_BT_TRACE_ENABLE
#include "wiced_bt_trace.h"
#endif
#include "a2dp_source.h"
#include "cyhal_gpio.h"
#include "cybsp.h"
#include <wav_1_test.h>


/******************************************************************************
 * Macros
 *****************************************************************************/

#define A2DP_SOURCE_NVRAM_ID                0
#define WICED_HS_EIR_BUF_MAX_SIZE           (264U)

#define LINE_SPEED_44K                      (330U)
#define LINE_SPEED_48K                      (345U)
#define LINE_SPEED_DEF                      (229U)

#define MAX_KEY_SIZE                        (16U)

#define FMT_DATA_LEN_2                      (2U)
#define FMT_DATA_LEN_4                      (4U)

#define AUDIO_SAMPLE_RATE_48kHz             (48000U)
#define AUDIO_SAMPLE_RATE_44_1kHz           (44100U)
#define AUDIO_SAMPLE_RATE_32kHz             (32000U)
#define AUDIO_SAMPLE_RATE_16kHz             (16000U)

#define AUDIO_CHANNEL_MONO                  1
#define AUDIO_CHANNEL_STEREO                2
#define AUDIO_CHANNEL_DUAL_CHANNEL          2
#define AUDIO_CHANNEL_JOINT_STEREO          2

#define AUDIO_BIT_WIDTH                     16

#define DEFAULT_SBC_BITPOOL                 51
#define SBC_A2DP_MODE                       0
#define SBC_WIDE_BAND_MODE                  1

#define SEC1000_MICROSEC                    (1000000000U)
#define FRAME_TIME_STAMP                    (90000U)
#define MARKER_PAYLOAD_BYTE                 (0x60U)
#define INQUIRY_DURATION                    (5U)

#define A2DP_TASK_STACK_SIZE                512
#define A2DP_TASK_PRIORITY                  (configMAX_PRIORITIES - 3)

#define GPIO_INTERRUPT_PRIORITY             (7u)

#define TASK_DELAY_1MS                      1
#define TASK_DELAY_10MS                     10


/* Bluetooth Device Address of the Speaker/Earbud */
#define BDA_ADDRESS_BYTE_0                  0x4C
#define BDA_ADDRESS_BYTE_1                  0x72
#define BDA_ADDRESS_BYTE_2                  0x74
#define BDA_ADDRESS_BYTE_3                  0xED
#define BDA_ADDRESS_BYTE_4                  0x9F
#define BDA_ADDRESS_BYTE_5                  0xC1


/* ***************************************************************************
 * Static variables
 * **************************************************************************/

static uint16_t handle = 0x0000;
static uint32_t  SampleRate      = AUDIO_SAMPLE_RATE_48kHz;
static uint64_t  usTimeout;
static uint32_t dwPCMBytesPerFrame;
static uint32_t Timestamp;
static uint32_t TimestampInc;
static uint8_t  stream_avdt_handle;
static uint32_t frame_per_packet;
static unsigned char *pBitstream    = NULL;
static unsigned int asc_stream_read_max = 0;
static unsigned int asc_stream_read_counter = 0;
static TaskHandle_t a2dp_task_handle;

/* ***************************************************************************
 * Global variables
 * **************************************************************************/
tAV_APP_CB      av_app_cb;

SemaphoreHandle_t stream_buff_sem;
uint16_t delay_reported_from_sink_micro_sec = 0;
unsigned int    frame_size;
volatile wiced_bool_t bStreamingActive = WICED_FALSE;
wiced_bt_heap_t *p_default_heap = NULL;
uint8_t pincode[WICED_PIN_CODE_LEN] = { 0x30, 0x30, 0x30, 0x30 };
cy_audio_sw_codec_encode_config_t enc_config;
cy_audio_sw_codec_t enc_handle;
uint32_t recommended_in_size;
uint32_t min_out_size;
uint32_t n_channels = 0;
uint32_t i_channel_mask;
uint32_t sample_rate;
uint32_t pcm_sz;
int32_t  length;
wiced_bt_device_link_keys_t nv_key_ram;
int16_t wav_header=0;
uint8_t *a2dp_frame;
uint8_t *encoder_output;
uint8_t  status_flag = 0;

#ifdef PSOC6_43012_BOARD
int8_t connection_status;
#endif

cyhal_gpio_callback_data_t gpio_btn_callback_data;

