Infineon/cce-mtb-psoc6-bt-a2dp-source/source/source_bluetooth/a2dp_source.c
/******************************************************************************
 * Extern variables and functions
 *****************************************************************************/
extern uint32_t getTick();
extern const uint8_t                        a2dp_source_sdp_db[A2DP_SOURCE_SDP_DB_SIZE];
extern const wiced_bt_cfg_settings_t        a2dp_source_cfg_settings;
extern wiced_bt_a2dp_source_config_data_t   bt_audio_config;
extern tAV_APP_CB av_app_cb;

/*******************************************************************************
* Function prototypes
*******************************************************************************/

void a2dp_source_audio_thread (void* arg);
static uint8_t a2dp_source_encode_sendSBC ();
static void a2dp_source_parse_sbc_params (wiced_bt_a2d_sbc_cie_t * pSbc, uint32_t *pSf,
                                          uint32_t *pBlocks, uint32_t *pSubbands, uint32_t *pMode);
uint16_t a2dp_source_calculate_delay ();
static void gpio_interrupt_handler(void *handler_arg, cyhal_gpio_event_t event);

/******************************************************************************
 * Function definitions
 ******************************************************************************/

/* ****************************************************************************
 * Function Name: get_audio_freq_name
 *******************************************************************************
 * Summary:
 *          Gives the string equivalent for the Event type
 *
 * Parameters:
 *          freq - Sample Frequency type
 *
 * Return:
 *          Pointer to String containing the Frequency Name
 *
 * ***************************************************************************/
static const char *get_audio_freq_name(uint8_t freq)
{
    switch((int)freq)
    {
        CASE_RETURN_STR(A2D_SBC_IE_SAMP_FREQ_16)
        CASE_RETURN_STR(A2D_SBC_IE_SAMP_FREQ_32)
        CASE_RETURN_STR(A2D_SBC_IE_SAMP_FREQ_44)
        CASE_RETURN_STR(A2D_SBC_IE_SAMP_FREQ_48)
    }

    return NULL;
}

/* ****************************************************************************
 * Function Name: get_audio_chcfg_name
 *******************************************************************************
 * Summary:
 *          Gives the string equivalent for the Event type
 *
 * Parameters:
 *          chcfg - Channel Configuration type
 *
 * Return:
 *          Pointer to String containing the Channel Configuration Name
 *
 * ***************************************************************************/
static const char *get_audio_chcfg_name(uint8_t chcfg)
{
    switch((int)chcfg)
    {
        CASE_RETURN_STR(A2D_SBC_IE_CH_MD_MONO)
        CASE_RETURN_STR(A2D_SBC_IE_CH_MD_DUAL)
        CASE_RETURN_STR(A2D_SBC_IE_CH_MD_STEREO)
        CASE_RETURN_STR(A2D_SBC_IE_CH_MD_JOINT)
    }

    return NULL;
}

/* ****************************************************************************
 * Function Name: a2dp_source_deinit_streaming
 ******************************************************************************
 * Summary:
 *        De-initialize the buffers and variables used for Audio Streaming state
 *
 * Parameters:
 *          None
 *
 * Return:
 *          None
 *
 * ***************************************************************************/
void a2dp_source_deinit_streaming()
{
    WICED_BT_TRACE ("De-iniatializing the stream buffer \n");
    bStreamingActive = FALSE;
    if (a2dp_frame != NULL)
    {
        free(a2dp_frame);
    }
    if (encoder_output != NULL)
    {
        free(encoder_output);
    }
    a2dp_frame = NULL;
    encoder_output = NULL;
}

/* ****************************************************************************
 * Function Name: a2dp_source_update_sink_rep_delay
 ******************************************************************************
 * Summary:
 *          Updates the delay report value to the latest as per the Sink
 *
 * Parameters:
 *          delay_ms: Delay in Milliseconds
 *
 * Return:
 *          None
 *
 * ***************************************************************************/
void a2dp_source_update_sink_rep_delay(uint16_t delay_ms)
{
    WICED_BT_TRACE("Updated Sink reported delay %u ms", delay_ms);
    delay_reported_from_sink_micro_sec += delay_ms * 1000;
}

/******************************************************************************
 * Function Name: asc_reset_params()
 *******************************************************************************
 * Summary: Decodes a wav file and points to the data by skipping the wav header.
 *
 *
 * Parameters:
 *          None
 *
 *
 * Return:
 *          None
 *
 ******************************************************************************/


static void asc_reset_params()
{
#if !ENABLE_AM_FS
    pBitstream = (unsigned char *)&hex_array;
    asc_stream_read_max = hex_array_size;
    asc_stream_read_counter = 0;
#endif
    if( 0 != cy_wav_header_decode( &n_channels,
                                &i_channel_mask, &sample_rate,
                                &pcm_sz, &length,
                                pBitstream,&asc_stream_read_counter,asc_stream_read_max) )
    {
        cy_asc_log_err(CY_RSLT_ASC_GENERIC_ERROR, "Error wav header parsing failed");
    }

    cy_asc_log_info("Input Params:  sample_rate: %lu, pcm_sz: %lu, n_channels: %lu, length: %ld "
                            , sample_rate
                            , pcm_sz
                            , n_channels
                            , length );
}

/* ****************************************************************************
 * Function Name: a2dp_source_start_streaming
 ******************************************************************************
 * Summary:
 *          Loads the required .wav file to memory, initializes the Encoder,
 *          Starts a thread for encoding and streaming audio
 *
 * Parameters:
 *          bActivate: State of Streaming as requested by the user
 *          avdt_handle: AVDTP Connection handle as received in the event
 *                       WICED_BT_A2DP_SOURCE_START_IND_EVT
 *          p_stream_cfg: CODEC Configuration
 *          peer_mtu: Stream MTU of the Peer side
 * Return:
 *          None
 *
 * ***************************************************************************/
void a2dp_source_start_streaming (wiced_bool_t bActivate, uint8_t avdt_handle,
                                  wiced_bt_a2d_sbc_cie_t *p_stream_cfg, uint16_t peer_mtu)
{
    uint32_t  NumBlocks       = 0;
    uint32_t  NumSubBands     = 0;
    uint32_t  NumChannels     = 0;
    uint32_t  Mode            = 0;

    sbc_encoder_params_t sbc_params;

    unsigned int fr_per_1000sec, pkts_per_1000sec;
    int join;
    cy_rslt_t            result;

    /* Safety check in case we are called more than once to do the same thing */
    if (bActivate == bStreamingActive)
    {
        WICED_BT_TRACE ("Streaming State: Already in %s",
                      bActivate ? "ACTIVE" : "SUSPEND");
        return;
    }

    WICED_BT_TRACE ("Streaming State: setting to %s \n",
                  bActivate ? "ACTIVE" : "SUSPEND");

