Infineon/cce-mtb-psoc6-bt-a2dp-source/source/source_bluetooth/a2dp_source.c
    if (!bActivate)
    {
        bStreamingActive = FALSE;
        return;
    }

    stream_avdt_handle = avdt_handle;

    WICED_BT_TRACE ("Streaming parameters: %u  samplesPerSec: %u  peer_mtu: %u",
                  bActivate, p_stream_cfg->samp_freq, peer_mtu);

    printf("\r\nPeer device configured to --> samp_freq %x ch_mode %d block_len %d num_subbands %d alloc_mthd %d max_bitpool %d min_bitpool %d \r\n",\
            p_stream_cfg->samp_freq,p_stream_cfg->ch_mode,p_stream_cfg->block_len,p_stream_cfg->num_subbands,p_stream_cfg->alloc_mthd,p_stream_cfg->max_bitpool,p_stream_cfg->min_bitpool);

    NumBlocks       = p_stream_cfg->block_len;
    NumSubBands     = p_stream_cfg->num_subbands;
    Mode            = p_stream_cfg->ch_mode;

    /* Extract the codec parameters */
    a2dp_source_parse_sbc_params (p_stream_cfg, &SampleRate, &NumBlocks, &NumSubBands, &Mode);

    WICED_BT_TRACE ("SampleRate: %u  NumBlocks: %u  NumSubBands: %u  Mode: %u",
                    SampleRate, NumBlocks, NumSubBands, Mode);

    NumChannels = Mode >= SBC_STEREO ? SBC_STEREO : SBC_DUAL;
    join = Mode == SBC_JOINT_STEREO ? SBC_DUAL : SBC_MONO;

    sbc_params.sbc_config.allocation_method = (p_stream_cfg->alloc_mthd == A2D_SBC_IE_ALLOC_MD_S ? SBC_SNR : SBC_LOUDNESS);
    sbc_params.sbc_config.channel_mode      = Mode;
    sbc_params.sbc_config.sbc_mode          = SBC_A2DP_MODE;
    sbc_params.sbc_config.sub_blocks        = NumBlocks;
    sbc_params.sbc_config.sub_bands         = NumSubBands;
    sbc_params.sbc_config.bit_pool          = DEFAULT_SBC_BITPOOL;
    sbc_params.sample_rate                  = AUDIO_SAMPLE_RATE_48kHz;
    sbc_params.channels                     = AUDIO_CHANNEL_STEREO;
    sbc_params.bit_width                    = AUDIO_BIT_WIDTH;

    asc_reset_params();
    wav_header = asc_stream_read_counter;

    printf("Wav header is %d \r\n",wav_header);

    result = sbc_encoder_app_init(&enc_handle, &sbc_params);
    if (result != CY_RSLT_SUCCESS)
    {
        cy_asc_log_err(result, "sw encoder init failed");
        return;
    }

    result = cy_audio_sw_codec_get_encoder_recommended_inbuf_size(enc_handle,&recommended_in_size);
    if(CY_RSLT_SUCCESS != result)
    {
        cy_asc_log_err(result, "failed to get recommended input buf sz.");
        return;
    }

    result = cy_audio_sw_codec_get_encoder_recommended_outbuf_size(enc_handle, recommended_in_size, &min_out_size);
    if(CY_RSLT_SUCCESS != result)
    {
        cy_asc_log_err(result, "failed to get recommended output buf sz.");
        return;
    }

    printf("SBC encoder recommended_in_size: %lu, min_out_size:%lu \r\n",recommended_in_size, min_out_size);

    /*FORMULA as in A2DP Spec:
     *
     * frame_length = 4 + (4 * nrof_subbands * nrof_channels ) / 8
     * nrof_blocks * nrof_channels * bitpool / 8 .
     * for the MONO and DUAL_CHANNEL channel modes, and
     * frame_length = 4 + (4 * nrof_subbands * nrof_channels ) / 8
     * (join * nrof_subbands + nrof_blocks * bitpool ) / 8
     */

    /* Calculate the periodicity to compress and send data in microseconds */
    frame_size = 4 + (4 * NumSubBands * sbc_params.channels) / 8
    + (join * NumSubBands + NumBlocks * sbc_params.sbc_config.bit_pool) / 8;

    frame_per_packet = (peer_mtu - AVDT_MEDIA_OFFSET) / frame_size;

    if (frame_per_packet > A2D_SBC_HDR_NUM_MSK)
      frame_per_packet = A2D_SBC_HDR_NUM_MSK;

    if (frame_per_packet == 0)
      frame_per_packet = 1;

    fr_per_1000sec = (SampleRate * 1000) / (NumSubBands * NumBlocks);

    pkts_per_1000sec = fr_per_1000sec / frame_per_packet;
    usTimeout = SEC1000_MICROSEC / pkts_per_1000sec;

    /*NumSubBands * NumBlocks * NumChannels* (bits_per_sample/2 )*/
    dwPCMBytesPerFrame = 2 * NumSubBands * NumBlocks * NumChannels;

    WICED_BT_TRACE ("Stream Starting:  pcm_bytes_per_frame %u \n", dwPCMBytesPerFrame);

    printf("Frame size is %u Frame per packet %lu \r\n",frame_size,frame_per_packet);
    /* Allocate memory */
    a2dp_frame = (uint8_t*)malloc(frame_size*frame_per_packet+1);
    encoder_output = (uint8_t*)malloc(min_out_size);

    Timestamp = 0;
    TimestampInc = ((NumBlocks * NumSubBands * FRAME_TIME_STAMP) / SampleRate) * frame_per_packet;
    printf("Timestamp increment is %ld \r\n",TimestampInc);

    printf("fr_per_1000sec %d \r\n",fr_per_1000sec);
    printf("pkts_per_1000sec %d \r\n",pkts_per_1000sec);
    printf("usTimeout %lld \r\n",usTimeout);




    WICED_BT_TRACE ("Stream Parameters: Sample rate %d  Blk: %d   SB: %d  BitP: %d  uS: %d  Frame Size: %d  Frame Per Packet: %d  fp1000s: %u \n",\
                    SampleRate, NumBlocks, NumSubBands, sbc_params.sbc_config.bit_pool, usTimeout, frame_size, frame_per_packet, fr_per_1000sec);


    result = xTaskCreate(a2dp_source_audio_thread, "Streaming task",A2DP_TASK_STACK_SIZE,NULL,A2DP_TASK_PRIORITY,&a2dp_task_handle);


    if (result != pdPASS)
    {
        cy_asc_log_info("Error in starting Streaming task \n");
    }

}

/* ****************************************************************************
 * Function Name: a2dp_source_encode_sendSBC
 ******************************************************************************
 * Summary:
 *          Calls Encoder to encode the PCM data and sends to Stack
 *
 * Parameters:
 *          None
 * Return:
 *          A2DP_APP_SUCCESS if the data is sent successfully
 *          A2DP_APP_FAILED if there was an error
 *
 * ***************************************************************************/
uint8_t a2dp_source_encode_sendSBC ()
{
    uint16_t    result      = A2DP_APP_SUCCESS;
    uint8_t     *pSBC;
    uint32_t    i;
    uint16_t    pkt_len     = 0;

    uint8_t     *output_buff;
    uint32_t    in_size     = 0;
    uint32_t    out_size    = 0;

    xSemaphoreTake(stream_buff_sem,portMAX_DELAY);

    pkt_len = frame_size*frame_per_packet;

       asc_stream_read_max = hex_array_size;

    if (asc_stream_read_counter+recommended_in_size>asc_stream_read_max)
    {
        asc_stream_read_counter = wav_header;
    }
    in_size = recommended_in_size;
    out_size = min_out_size;
    output_buff = a2dp_frame;

