Infineon/cce-mtb-psoc6-bt-a2dp-source/source/source_bluetooth/a2dp_source.c
    memset(encoder_output,0x00,out_size);
    memset(a2dp_frame,0x00,pkt_len+1);

    for (i = 0; i < frame_per_packet; i++)
    {

        pSBC = (uint8_t *)hex_array;

        pSBC += asc_stream_read_counter;

        result = sbc_encoder_app_encode(enc_handle, pSBC, &in_size, encoder_output, &out_size);
        if (result != CY_RSLT_SUCCESS)
        {
            printf("Encoding error \r\n");
        }


        if (i == 0)
        {
            *output_buff = frame_per_packet;
            output_buff += 1;
        }
        memcpy(output_buff,encoder_output,out_size);
        output_buff += out_size;
        asc_stream_read_counter += recommended_in_size;
    }

    result = wiced_bt_avdt_write_req (stream_avdt_handle, a2dp_frame, pkt_len+1,Timestamp, MARKER_PAYLOAD_BYTE, 0);

    if (result != AVDT_SUCCESS)
    {
        printf("AVDT failed with result %d for timestamp %ld for outsize %d \r\n",result, Timestamp,pkt_len);
        result = A2DP_APP_FAILED;
    }

    Timestamp += TimestampInc;

    if(asc_stream_read_counter >= asc_stream_read_max)
    {
        asc_stream_read_counter = wav_header;
    }

    return result;
}

/* ****************************************************************************
 * Function Name: a2dp_source_calculate_delay
 ******************************************************************************
 * Summary:
 *          Calculate the required delay to wait for next audio write
 *
 * Parameters:
 *          None
 * Return:
 *          delay_in_micro_sec: Delay in microseconds
 *
 * ***************************************************************************/
uint16_t a2dp_source_calculate_delay()
{
    float bytes_per_pkt = 0;
    float delay_in_micro_sec = 0;

    bytes_per_pkt = frame_size * frame_per_packet;
    delay_in_micro_sec = ((bytes_per_pkt * 1000) / (SampleRate *2)) * 1000;
    WICED_BT_TRACE (" Required delay is %d between pkts of size %d to achieve SampleRate %d",
                    (uint16_t)delay_in_micro_sec, (uint16_t)bytes_per_pkt, SampleRate);
    return (uint16_t)delay_in_micro_sec;
}

/* ****************************************************************************
 * Function Name: a2dp_source_audio_thread
 ******************************************************************************
 * Summary:
 *          Thread to handle the audio encoding and streaming
 *
 * Parameters:
 *          NULL
 * Return:
 *          NULL
 *
 * ***************************************************************************/
void a2dp_source_audio_thread(void* arg)
{
    cy_rslt_t result = 0;
    uint16_t delay_in_micro_sec = 0;

    stream_buff_sem = xSemaphoreCreateBinary();
    if ( stream_buff_sem == NULL )
    {
        printf("Error in semaphore \r\n");
        return;
    }

    /* Initialize the User Button */
    result = cyhal_gpio_init(CYBSP_USER_BTN, CYHAL_GPIO_DIR_INPUT, CYHAL_GPIO_DRIVE_PULLUP, CYBSP_BTN_OFF);
    if (result != CY_RSLT_SUCCESS)
    {
        printf("Error: Failed to initialize User Button \r\n");
        CY_ASSERT(0);
    }
    /* Configure GPIO interrupt */
    gpio_btn_callback_data.callback = gpio_interrupt_handler;
    cyhal_gpio_register_callback(CYBSP_USER_BTN, &gpio_btn_callback_data);
    cyhal_gpio_enable_event(CYBSP_USER_BTN, CYHAL_GPIO_IRQ_FALL, GPIO_INTERRUPT_PRIORITY, true);

    WICED_BT_TRACE("a2dp_src_thread usTimeout: %u \n", usTimeout);

    delay_in_micro_sec = a2dp_source_calculate_delay() + delay_reported_from_sink_micro_sec;
    printf("Delay in micro sec is %d \r\n",delay_in_micro_sec);
    printf("portTICK_PERIOD_MS is %ld (float)(delay_in_micro_sec*0.001)/portTICK_PERIOD_MS is %f %f \r\n",portTICK_PERIOD_MS,(float)(delay_in_micro_sec*0.001)/portTICK_PERIOD_MS,(float)(delay_in_micro_sec*0.001)/portTICK_PERIOD_MS);

    printf("\r\nPress User Btn1 to play/pause the stream... \r\n");
    xSemaphoreGive(stream_buff_sem);

    while (1)
    {
        if (bStreamingActive == WICED_TRUE && status_flag == 1)
        {
            printf("Streaming Audio,Press User Btn1 to pause... \r\n");
            status_flag=0;
        }
        if (bStreamingActive == WICED_FALSE && status_flag == 1)
        {
            printf("Streaming Audio Paused !, Press User Btn1 to play ... \r\n");
            status_flag=0;
        }
        if (bStreamingActive == WICED_FALSE)
        {
            vTaskDelay(TASK_DELAY_10MS);
            continue;
        }

        if (A2DP_APP_FAILED == a2dp_source_encode_sendSBC())
        {
            WICED_BT_TRACE("Encode and Send failed. \n");
        }
        vTaskDelay(TASK_DELAY_1MS);
    }

    WICED_BT_TRACE("a2dp_src_thread() exit");
}

/* ****************************************************************************
 * Function Name: a2dp_source_parse_sbc_params
 ******************************************************************************
 * Summary:
 *          Parse SBC Parameters and set teh configuration for Encoder
 *
 * Parameters:
 *          NULL
 * Return:
 *          NULL
 *
 * ***************************************************************************/
static void a2dp_source_parse_sbc_params (wiced_bt_a2d_sbc_cie_t * pSbc, uint32_t *pSf,
                                          uint32_t *pBlocks, uint32_t *pSubbands, uint32_t *pMode)
{
    switch (pSbc->samp_freq)
    {
    case A2D_SBC_IE_SAMP_FREQ_16:
        *pSf = AUDIO_SAMPLE_RATE_16kHz;
        break;
    case A2D_SBC_IE_SAMP_FREQ_32:
        *pSf = AUDIO_SAMPLE_RATE_32kHz;
        break;
    case A2D_SBC_IE_SAMP_FREQ_44:
        *pSf = AUDIO_SAMPLE_RATE_44_1kHz;
        break;
    case A2D_SBC_IE_SAMP_FREQ_48:
        *pSf = AUDIO_SAMPLE_RATE_48kHz;
        break;
    }

    switch (pSbc->block_len)
    {
    case A2D_SBC_IE_BLOCKS_4:
        *pBlocks = SBC_BLOCK_0;
        break;
    case A2D_SBC_IE_BLOCKS_8:
        *pBlocks = SBC_BLOCK_1;
        break;
    case A2D_SBC_IE_BLOCKS_12:
        *pBlocks = SBC_BLOCK_2;
        break;
    case A2D_SBC_IE_BLOCKS_16:
        *pBlocks = SBC_BLOCK_3;
        break;
    }

