Infineon/cce-mtb-psoc6-bt-a2dp-source/source/source_bluetooth/a2dp_source.c
    switch (pSbc->num_subbands)
    {
    case A2D_SBC_IE_SUBBAND_4:
        *pSubbands = SUB_BANDS_4;
        break;
    case A2D_SBC_IE_SUBBAND_8:
        *pSubbands = SUB_BANDS_8;
        break;
    }

    switch (pSbc->ch_mode)
    {
    case A2D_SBC_IE_CH_MD_MONO:
        *pMode = SBC_MONO;
        break;
    case A2D_SBC_IE_CH_MD_DUAL:
        *pMode = SBC_DUAL;
        break;
    case A2D_SBC_IE_CH_MD_STEREO:
        *pMode = SBC_STEREO;
        break;
    case A2D_SBC_IE_CH_MD_JOINT:
        *pMode = SBC_JOINT_STEREO;
        break;
    }
}

/* ****************************************************************************
 * Function Name: a2dp_source_set_audio_streaming
 ******************************************************************************
 * Summary:
 *          Set Audio Streaming state and initiate the action accordingly.
 *
 * Parameters:
 *          None
 *
 * Return:
 *          None
 *
 * ***************************************************************************/
static void a2dp_source_set_audio_streaming(uint8_t handle, wiced_bool_t start_audio)
{
    WICED_BT_TRACE("Setting Audio Stream State to %d \n", start_audio);

    if (start_audio)
    {
        wiced_bt_dev_cancel_sniff_mode(av_app_cb.peer_bda);
        a2dp_source_start_streaming(WICED_TRUE, handle, &av_app_cb.codec_config.cie.sbc, av_app_cb.stream_mtu);
    }
    else
    {
        a2dp_source_start_streaming(WICED_FALSE, handle, NULL, 0);
    }
}

/* ****************************************************************************
 * Function Name: a2dp_source_control_cback
 ******************************************************************************
 * Summary:
 *          Control callback supplied by  the a2dp source profile code.
 *
 * Parameters:
 *          event - control event called back
 *          p_data - event data
 *
 * Return:
 *          None
 *
 * ***************************************************************************/
void  a2dp_source_control_cback (wiced_bt_a2dp_source_event_t event, wiced_bt_a2dp_source_event_data_t *p_data)
{
#if WICED_BT_A2DP_SOURCE_DEBUG
    printf("a2dp_source_control_cback is %d \r\n",event);
#endif

    switch (event)
    {
    case WICED_BT_A2DP_SOURCE_CONNECT_EVT:
        if (NULL == p_data)
        {
            WICED_BT_TRACE ("A2DP Source Control Callback with event data pointer NULL \n");
            return;
        }
        /**< Connected event, received on establishing connection to a peer device. Ready to stream. */
        if (p_data->connect.result == WICED_SUCCESS)
        {
            /* Save the address of the remote device on remote connection */
            memcpy (av_app_cb.peer_bda, p_data->connect.bd_addr,
                sizeof(wiced_bt_device_address_t));
            av_app_cb.lcid = p_data->connect.lcid;

            /* Maintain State */
            av_app_cb.state = AV_STATE_OPEN;

            WICED_BT_TRACE ("Connected to addr: <%x> Handle %d \n\r",p_data->connect.bd_addr,
                            p_data->connect.handle);

            handle = p_data->connect.handle;
#ifdef PSOC6_43012_BOARD
            connection_status = A2DP_PEER_CONNECTED;
#endif
            printf("Connected to BT Speaker/Earbuds ... \r\n\r\n");
            printf("Configuring A2DP stream to 48KHz, Stereo \r\n");
            a2dp_source_command_stream_config ((uint8_t)AUDIO_SF_48K, AUDIO_CHCFG_STEREO);


            wiced_bt_dev_setAclPacketTypes (
            av_app_cb.peer_bda,
            HCI_PKT_TYPES_MASK_DM5 | HCI_PKT_TYPES_MASK_DH5 | /* Use 1 mbps 5 slot packets */
            HCI_PKT_TYPES_MASK_DH3 | HCI_PKT_TYPES_MASK_DM3 | /* Use 1 mbps 3 slot packets */
            HCI_PKT_TYPES_MASK_DH1 | HCI_PKT_TYPES_MASK_DM1 | /* Use 1 mbps 1 slot packets */
            HCI_PKT_TYPES_MASK_NO_3_DH1 | /* Don't use 3 mbps 1 slot packets */
            HCI_PKT_TYPES_MASK_NO_3_DH3 | /* Don't use 3 mbps 3 slot packets */
            HCI_PKT_TYPES_MASK_NO_3_DH5); /* Don't use 3 mbps 5 slot packets */

            a2dp_source_command_stream_start ();


        }
        else
        {
            WICED_BT_TRACE (" a2dp source connection to <%x> failed %d \n", p_data->connect.bd_addr,
                  p_data->connect.result);
            printf("Connection Failed to %x:%x:%x:%x:%x:%x. Reset the board. \r\n",p_data->connect.bd_addr[0], p_data->connect.bd_addr[1], p_data->connect.bd_addr[2],p_data->connect.bd_addr[3],p_data->connect.bd_addr[4],p_data->connect.bd_addr[5]);
        }



        break;

    case WICED_BT_A2DP_SOURCE_DISCONNECT_EVT:
        /**< Disconnected event, received on disconnection from a peer device */
        /* Maintain State */
        av_app_cb.state = AV_STATE_IDLE;
        a2dp_source_deinit_streaming();
        handle = 0; /* reset connection handle */
        printf ("A2DP peer disconnected. Reset the board. \r\n");
#ifdef PSOC6_43012_BOARD
        connection_status = A2DP_PEER_DISCONNECTED;
#endif
        break;

    case WICED_BT_A2DP_SOURCE_CONFIGURE_EVT:
        if (NULL == p_data)
        {
            WICED_BT_TRACE ("A2DP Source Control Callback with event data pointer NULL \n");
            return;
        }
        /* Maintain State */
        av_app_cb.state = AV_STATE_CONFIGURE;
        memcpy (&av_app_cb.codec_config, p_data->set_config.codec_config,
          sizeof(wiced_bt_a2dp_codec_info_t));
        av_app_cb.stream_mtu = p_data->set_config.stream_mtu;
        break;

    case WICED_BT_A2DP_SOURCE_START_IND_EVT:
        printf("WICED_BT_A2DP_SOURCE_START_IND_EVT \r\n");
        if (NULL == p_data)
        {
            WICED_BT_TRACE ("A2DP Source Control Callback with event data pointer NULL \n");
            return;
        }
        if (!wiced_bt_a2dp_source_send_start_response (p_data->start_ind.handle,
                             p_data->start_ind.label,
                             A2D_SUCCESS))
        {
            printf("wiced_bt_a2dp_source_send_start_response no error !!!! \r\n");
            if (av_app_cb.state != AV_STATE_STARTED)
            {
                WICED_BT_TRACE (" a2dp source streaming started handle:%d lcid %x \n",
                  p_data->start_cfm.handle, av_app_cb.lcid);
                printf("WICED_BT_A2DP_SOURCE_START_IND_EVT start streaming \r\n");

