Infineon/cce-mtb-psoc6-bt-a2dp-source/source/source_bluetooth/a2dp_source.c
                a2dp_source_set_audio_streaming (p_data->start_ind.handle, WICED_TRUE);
                av_app_cb.state = AV_STATE_STARTED;
            }
            else
            {
                WICED_BT_TRACE (" a2dp source streaming already started \n");
            }
        }
        break;

    case WICED_BT_A2DP_SOURCE_START_CFM_EVT:
        if (NULL == p_data)
        {
            WICED_BT_TRACE ("A2DP Source Control Callback with event data pointer NULL \n");
            return;
        }
        /*Start stream event, received when audio streaming is about to start*/
        if (p_data->start_cfm.result != WICED_SUCCESS)
        {
            WICED_BT_TRACE ("Stream start Error \n");
            break;
        }
        if (av_app_cb.state != AV_STATE_STARTED)
        {
            WICED_BT_TRACE (" a2dp source streaming started handle:%d lcid %x \n",
              p_data->start_cfm.handle, av_app_cb.lcid);
            a2dp_source_set_audio_streaming (p_data->start_cfm.handle, WICED_TRUE);
            av_app_cb.state = AV_STATE_STARTED;
        }
        else
        {
            WICED_BT_TRACE (" a2dp source streaming already started \n");
        }
        break;

    case WICED_BT_A2DP_SOURCE_SUSPEND_EVT:
        /**< Suspend stream event, received when audio streaming is suspended */
        /* Maintain State */
        av_app_cb.state = AV_STATE_OPEN;
        WICED_BT_TRACE (" a2dp source streaming suspended \n");
        a2dp_source_set_audio_streaming (p_data->suspend.handle, WICED_FALSE);
        break;

    case WICED_BT_A2DP_SOURCE_WRITE_CFM_EVT:

        xSemaphoreGive(stream_buff_sem);

        break;

    case WICED_BT_A2DP_SOURCE_DELAY_RPT_EVT:
        if (NULL == p_data)
        {
            WICED_BT_TRACE ("A2DP Source Control Callback with event data pointer NULL \n");
            return;
        }
        WICED_BT_TRACE ("a2dp source WICED_BT_A2DP_SOURCE_DELAY_RPT_EVT delay is %d\n",
              p_data->delay_ms);
        a2dp_source_update_sink_rep_delay (p_data->delay_ms);
        break;

    default:
        WICED_BT_TRACE ("a2dp source Unhandled Event %d\n", event);
        break;
    }
}

/* ****************************************************************************
 * Function Name: a2dp_source_bt_inquiry_result_cback
 ******************************************************************************
 * Summary:
 *          Handle Inquiry result callback from teh stack, format and
 *          send event over UART
 *
 * Parameters:
 *          p_inquiry_result - Inquiry result consisting BD address,
 *                             RSSI and Device class
 *          p_eir_data - EIR data
 *
 * Return:
 *          None
 *
 * ***************************************************************************/
void a2dp_source_bt_inquiry_result_cback( wiced_bt_dev_inquiry_scan_result_t *p_inquiry_result, uint8_t *p_eir_data )
{
    uint8_t   len; /* length of EIR data */

    if (p_inquiry_result == NULL)
    {
        WICED_BT_TRACE( "Inquiry complete \n");
    }
    else
    {
        WICED_BT_TRACE( "Inquiry result: ");
        print_bd_address (p_inquiry_result->remote_bd_addr );
        WICED_BT_TRACE_ARRAY((uint8_t*)(p_inquiry_result->dev_class), 3, "COD :" );
        WICED_BT_TRACE( "RSSI: ", p_inquiry_result->rssi );

        /* currently callback does not pass the data of the adv data,
         * need to go through the data
         * zero len in the LTV means that there is no more data
         */
        if (( p_eir_data != NULL ) && ( len = *p_eir_data ) != 0)
        {
            WICED_BT_TRACE_ARRAY( ( uint8_t* )( p_eir_data ), len, "EIR :" );
        }
    }
}

/* ****************************************************************************
 * Function Name: a2dp_source_bt_inquiry
 ******************************************************************************
 * Summary:
 *        Handle Inquiry command from user
 *
 * Parameters:
 *        enable - Enable Inquiry if 1, Cancel if 0
 *
 * Return:
 *        wiced_result_t: result of start or cancel inquiry operation initiation
 *
 * ***************************************************************************/
wiced_result_t a2dp_source_bt_inquiry( uint8_t enable )
{
    wiced_result_t           result;
    wiced_bt_dev_inq_parms_t params;

    if ( enable )
    {
        memset( &params, 0, sizeof( params ) );

        params.mode             = BTM_GENERAL_INQUIRY;
        params.duration         = INQUIRY_DURATION;
        params.filter_cond_type = BTM_CLR_INQUIRY_FILTER;

        result = wiced_bt_start_inquiry( &params, &a2dp_source_bt_inquiry_result_cback );
        if (result == WICED_BT_PENDING)
        {
            result = WICED_BT_SUCCESS;
        }
        WICED_BT_TRACE( "Inquiry started:%d\n", result );
    }
    else
    {
        result = wiced_bt_cancel_inquiry( );
        WICED_BT_TRACE( "Cancel inquiry:%d\n", result );
    }
    return result;
}

/* ****************************************************************************
 * Function Name: a2dp_source_bt_set_visibility
 ******************************************************************************
 * Summary:
 *          Handle Set Visibility command
 *
 * Parameters:
 *          discoverability: Discoverable if 1, Non-discoverable if 0
 *          connectability: Connectable if 1, Non-connectable if 0
 *
 * Return:
 *          wiced_result_t: result of set visibility operation
 *
 * ***************************************************************************/
wiced_result_t a2dp_source_bt_set_visibility( uint8_t discoverability, uint8_t connectability )
{
    wiced_result_t status = WICED_BT_SUCCESS;

    if ((discoverability > 1) || (connectability > 1))
    {
        WICED_BT_TRACE( "Invalid Input \n");
        status = WICED_BT_ERROR;
    }
    else if ((discoverability != 0) && (connectability == 0))
    {
        /* we cannot be discoverable and not connectable */
        WICED_BT_TRACE("we cannot be discoverable and not connectable \n");
        status = WICED_BT_ERROR;
    }
    else
    {
        wiced_bt_dev_set_discoverability((discoverability != 0) ? BTM_GENERAL_DISCOVERABLE : BTM_NON_DISCOVERABLE,
                                            BTM_DEFAULT_DISC_WINDOW,
                                            BTM_DEFAULT_DISC_INTERVAL);

