Infineon/cce-mtb-psoc6-bt-a2dp-source/source/source_bluetooth/a2dp_source.c
        wiced_bt_dev_set_connectability((connectability != 0) ? WICED_TRUE : WICED_FALSE,
                                            BTM_DEFAULT_CONN_WINDOW,
                                            BTM_DEFAULT_CONN_INTERVAL);
    }
    return status;
}

/* ****************************************************************************
 * Function Name: a2dp_source_bt_set_pairability
 ******************************************************************************
 * Summary:
 *          Handle Set Pairability command
 *
 * Parameters:
 *          pairing_allowed: Pairing allowed if 1, not allowed if 0
 *
 * Return:
 *          None
 *
 * ***************************************************************************/
void a2dp_source_bt_set_pairability( uint8_t pairing_allowed )
{
    wiced_bt_set_pairable_mode(pairing_allowed, TRUE);
    WICED_BT_TRACE( "Set the pairing allowed to %d \n", pairing_allowed );
}

/* ****************************************************************************
 * Function Name: a2dp_source_bt_print_local_bda
 ******************************************************************************
 * Summary:
 *          Print Local BDA command
 *
 * Parameters:
 *          None
 *
 * Return:
 *          None
 *
 * ***************************************************************************/
void a2dp_source_bt_print_local_bda( void )
{
    wiced_bt_device_address_t bda = { 0 };

    wiced_bt_dev_read_local_addr(bda);
    WICED_BT_TRACE( "Local Bluetooth Device Address:");
    print_bd_address (bda);
}

/* ****************************************************************************
 * Function Name: a2dp_source_command_connect
 ******************************************************************************
 * Summary:
 *          Connects to the A2DP Sink with the given BD-Address
 *
 * Parameters:
 *          bd_addr: Remote BD Address
 *          len: Length of the BD-address.
 *
 * Return:
 *          status: result of a2dp connect API
 *
 * ***************************************************************************/
wiced_result_t a2dp_source_command_connect(wiced_bt_device_address_t bd_addr, uint32_t len)
{
    wiced_result_t status = WICED_BT_SUCCESS;

    if (handle > 0)
    {
        WICED_BT_TRACE("Already Connected \n\r");
        status = WICED_BT_ERROR;
    }
    else
    {
        WICED_BT_TRACE("Connecting to [%x] \n\r", bd_addr );
        status = wiced_bt_a2dp_source_connect(bd_addr);
    }
    return status;
}

/* ****************************************************************************
 * Function Name: a2dp_source_command_disconnect
 ******************************************************************************
 * Summary:
 *          Disconnects the A2DP Sink that is already connected
 *
 * Parameters:
 *          None
 *
 * Return:
 *          status: result of a2dp disconnect API
 *
 * ***************************************************************************/
wiced_result_t a2dp_source_command_disconnect()
{
    wiced_result_t status = WICED_BT_SUCCESS;

    WICED_BT_TRACE( "Disconnecting Connection with Handle %d\n\r", handle );
    if (handle == 0)
    {
        status = WICED_BT_ERROR;
    }
    else
    {
        status = wiced_bt_a2dp_source_disconnect(handle);
        av_app_cb.state = AV_STATE_DISCONNECTING;
    }

    return status;
}

/* ****************************************************************************
 * Function Name: a2dp_source_command_stream_config
 ******************************************************************************
 * Summary:
 *          Configures the A2DP Stream
 *
 * Parameters:
 *          sf: sample frequency
 *          chcfg: channel configuration.
 *
 * Return:
 *          None
 *
 * ***************************************************************************/
void a2dp_source_command_stream_config(uint8_t sf, uint8_t chcfg)
{
    switch (sf)
    {
    case AUDIO_SF_16K:
        sf = A2D_SBC_IE_SAMP_FREQ_16;
        break;
    case AUDIO_SF_32K:
        sf = A2D_SBC_IE_SAMP_FREQ_32;
        break;
    case AUDIO_SF_44_1K:
        sf = A2D_SBC_IE_SAMP_FREQ_44;
        break;
    case AUDIO_SF_48K:
        sf = A2D_SBC_IE_SAMP_FREQ_48;
        break;
    default:
        sf = A2D_SBC_IE_SAMP_FREQ_48;
        break;
    }

    switch (chcfg)
    {
    case AUDIO_CHCFG_MONO:
        chcfg = A2D_SBC_IE_CH_MD_MONO;
        break;
    case AUDIO_CHCFG_STEREO:
        chcfg = A2D_SBC_IE_CH_MD_STEREO;
        break;
    default:
        chcfg = A2D_SBC_IE_CH_MD_STEREO;
        break;
    }

    if (!(sf == bt_audio_config.default_codec_config.cie.sbc.samp_freq) &&
     (chcfg == bt_audio_config.default_codec_config.cie.sbc.ch_mode))
    {
        a2dp_source_deinit_streaming();
        bt_audio_config.default_codec_config.cie.sbc.samp_freq = sf;
        bt_audio_config.default_codec_config.cie.sbc.ch_mode = chcfg;
    }
    WICED_BT_TRACE( "Handle %d sf:%s chcfg:%s\n\r", handle,
                    get_audio_freq_name (sf), get_audio_chcfg_name (chcfg) );
}

/* ****************************************************************************
 * Function Name: a2dp_source_command_stream_start
 ******************************************************************************
 * Summary:
 *          Initiates Stream Start
 *
 * Parameters:
 *          None
 *
 * Return:
 *          status: result of Stream Start API
 *
 * ***************************************************************************/
wiced_result_t a2dp_source_command_stream_start()
{
    WICED_BT_TRACE( "Stream Start for Connection Handle %d\n\r", handle);

    if (handle == 0)
    {
       return WICED_BT_ERROR;
    }
    return wiced_bt_a2dp_source_start(handle, &bt_audio_config.default_codec_config);
}

/* ****************************************************************************
 * Function Name: a2dp_source_command_stream_stop
 ******************************************************************************
 * Summary:
 *          Initiates Stream Suspend
 *
 * Parameters:
 *          None
 *
 * Return:
 *          status: result of Stream Suspend API
 *
 * ***************************************************************************/
wiced_result_t a2dp_source_command_stream_stop()
{
    WICED_BT_TRACE( "Stream Stop for Connection Handle %d\n\r", handle);

