Infineon/cce-mtb-psoc6-bt-a2dp-source/source/source_bluetooth/a2dp_source.c
    if (handle == 0)
    {
        return WICED_BT_ERROR;
    }

    return wiced_bt_a2dp_source_suspend(handle);
}

/******************************************************************************
 * Function Name: a2dp_source_write_eir
 *******************************************************************************
 * Summary:
 *          Prepare extended inquiry response data.  Current version publishes
 *          audio source services.
 *
 * Parameters:
 *          None
 *
 * Return:
 *          None
 *
 ******************************************************************************/
void a2dp_source_write_eir( void )
{
    uint8_t *pBuf;
    uint8_t *p;
    uint8_t *p_tmp;
    uint8_t nb_uuid = 0;
    uint8_t length;

    /* Allocating a buffer from the public pool */
    pBuf = (uint8_t*) wiced_bt_get_buffer ( WICED_HS_EIR_BUF_MAX_SIZE);

    if (!pBuf)
    {
        WICED_BT_TRACE ("Buffer allocation for EIR Data failed \n");
        return;
    }

    WICED_BT_TRACE ("EIR allocated Buffer: %x\n", pBuf);
    p = pBuf;

    length = (uint8_t) strlen ((char*) a2dp_source_cfg_settings.device_name);

    WICED_BT_TRACE ("length %d\n", (uint8_t)length);
    UINT8_TO_STREAM (p, length + 1);
    UINT8_TO_STREAM (p, BT_EIR_COMPLETE_LOCAL_NAME_TYPE);
    memcpy (p, a2dp_source_cfg_settings.device_name, length);
    p += length;

    /* Add other BR/EDR UUIDs */
    p_tmp = p;
    p++;
    UINT8_TO_STREAM (p, BT_EIR_COMPLETE_16BITS_UUID_TYPE);
    UINT16_TO_STREAM (p, UUID_SERVCLASS_AUDIO_SOURCE);
    nb_uuid++;

    /* Now, we can update the UUID Tag's length */
    UINT8_TO_STREAM (p_tmp, (nb_uuid * LEN_UUID_16) + 1);

    /* Last Tag */
    UINT8_TO_STREAM (p, 0x00);

    /* print EIR data */
    WICED_BT_TRACE_ARRAY( ( uint8_t* )( pBuf+1 ), MIN( p-( uint8_t* )pBuf,100 ), "EIR :" );
    wiced_bt_dev_write_eir( pBuf, (uint16_t)(p - pBuf) );

    /* Allocated buffer not anymore needed. Free it */
    wiced_bt_free_buffer (pBuf);
}

/******************************************************************************
 * Function Name: a2dp_source_write_nvram
 *******************************************************************************
 * Summary:
 *          Write NVRAM function is called to store information but in PSoC6 it will not be stored.
 *
 * Parameters:
 *          nvram_id: NVRAM Id
 *          data_len: Length of the data to be written
 *          p_data: Data to be written
 *
 * Return:
 *          Number of bytes written
 *
 *****************************************************************************/
uint16_t a2dp_source_write_nvram( int nvram_id, int data_len, void *p_data)
{
    uint16_t        bytes_written = 0;
    int i=0;

    if (p_data != NULL)
    {
        bytes_written=data_len;
        memcpy(&nv_key_ram,p_data,sizeof(wiced_bt_device_link_keys_t));
        printf("Link Key is ");
        for (i=0; i<LINK_KEY_LEN; i++) {
            printf("%x ",nv_key_ram.key_data.br_edr_key[i]);
        }
        printf("\r\n");

        WICED_BT_TRACE("NVRAM ID:%d written :%d bytes \n", nvram_id, bytes_written);
    }

    return (bytes_written);
}


/******************************************************************************
 * Function Name: a2dp_source_read_nvram
 *******************************************************************************
 * Summary:
 *          Read data from the NVRAM and return in the passed buffer
 *
 * Parameters:
 *          nvram_id: NVRAM Id
 *          data_len: Length of the data to be read
 *          p_data: Data buffer pointer to hold read data
 *
 * Return:
 *          Number of bytes read
 *
 *****************************************************************************/
uint16_t a2dp_source_read_nvram( int nvram_id, void *p_data, int data_len)
{
    uint16_t        read_bytes = 0;

    if ((p_data != NULL) && (data_len >= sizeof(wiced_bt_device_link_keys_t)))
    {
        memset(&nv_key_ram,0xFF,sizeof(wiced_bt_device_link_keys_t));
        WICED_BT_TRACE("NVRAM ID:%d read out of %d bytes:%d \n", nvram_id,
                       sizeof(wiced_bt_device_link_keys_t), read_bytes );
    }
    return (read_bytes);
}

/******************************************************************************
 * Function Name: a2dp_source_app_init()
 *******************************************************************************
 * Summary:
 *   This function handles application level initialization tasks and is
 *   called from the BT management callback once the Bluetooth Stack enabled
 *   event (BTM_ENABLED_EVT) is triggered
 *   This function is executed in the BTM_ENABLED_EVT management callback.
 *
 * Parameters:
 *   None
 *
 * Return:
 *   None
 *
 ******************************************************************************/
void a2dp_source_app_init( void )
{
    wiced_result_t result = WICED_BT_SUCCESS;
    av_app_cb.state = AV_STATE_IDLE;

    /* Register with the A2DP source profile code */
    result = wiced_bt_a2dp_source_init( &bt_audio_config,
                                        a2dp_source_control_cback, p_default_heap);
    if (result == WICED_BT_SUCCESS)
    {
        WICED_BT_TRACE( "A2DP Source initialized \n\r");

    }
    else
    {
        WICED_BT_TRACE( "A2DP Source initialization failed \n\r");
    }
}

/******************************************************************************
 * Function Name: a2dp_source_management_callback()
 *******************************************************************************
 * Summary:
 *   This is a Bluetooth stack event handler function to receive management
 *   events from the Bluetooth stack and process as per the application.
 *
 * Parameters:
 *   wiced_bt_management_evt_t event : BLE event code of one byte length
 *   wiced_bt_management_evt_data_t *p_event_data: Pointer to BTStack management
 *   event structures
 *
 * Return:
 *  wiced_result_t: Error code from WICED_RESULT_LIST or BT_RESULT_LIST
 *
 ******************************************************************************/

wiced_result_t a2dp_source_management_callback( wiced_bt_management_evt_t event,
                                              wiced_bt_management_evt_data_t *p_event_data )
{
    wiced_bt_ble_advert_mode_t          *p_mode; /* Advertisement Mode */
    wiced_bt_device_address_t           bda = {0};
    wiced_result_t                      result = WICED_BT_SUCCESS;

    wiced_bt_power_mgmt_notification_t *p_power_mgmt_notification;
    wiced_bt_dev_encryption_status_t   *p_encryption_status;
    wiced_bt_dev_pairing_cplt_t        *p_pairing_cmpl;
    int                                 pairing_result;
    wiced_bt_device_address_t           bda_str;

    WICED_BT_TRACE("A2dp source management callback: %s\n", get_bt_event_name(event));

    switch( event )
    {
    /* Bluetooth  stack enabled */
    case BTM_ENABLED_EVT:
        if (p_event_data == NULL)
        {
            WICED_BT_TRACE("Callback data pointer p_event_data is NULL \n");
            break;
        }
        if (WICED_BT_SUCCESS == p_event_data->enabled.status)
        {
            /* Bluetooth is enabled */
            wiced_bt_dev_read_local_addr(bda);
            WICED_BT_TRACE("Bluetooth Enabled \n");
            WICED_BT_TRACE("Local Bluetooth Address: ");
            print_bd_address(bda);

