Infineon/cce-mtb-psoc6-bt-a2dp-source/source/source_bluetooth/a2dp_source.c
            /* Set Discoverable */
            a2dp_source_bt_set_visibility (WICED_FALSE, WICED_TRUE);

            /* Enable pairing */
            wiced_bt_set_pairable_mode(WICED_TRUE, 0);

            a2dp_source_write_eir();

            /* create SDP records */
            wiced_bt_sdp_db_init((uint8_t*) a2dp_source_sdp_db,
                sizeof(a2dp_source_sdp_db));

           /* start the a2dp application */
           a2dp_source_app_init();

           a2dp_source_bt_set_pairability(1);
           /* If Inquiry is required enable the a2dp_source_bt_inquiry API. */
           /* a2dp_source_bt_inquiry (1); */
           a2dp_source_bt_set_visibility (WICED_TRUE, WICED_TRUE);
           printf("Connecting to BT Speaker/Earbuds...\r\n");

           bda_str[0] = (uint8_t)BDA_ADDRESS_BYTE_0;
           bda_str[1] = (uint8_t)BDA_ADDRESS_BYTE_1;
           bda_str[2] = (uint8_t)BDA_ADDRESS_BYTE_2;
           bda_str[3] = (uint8_t)BDA_ADDRESS_BYTE_3;
           bda_str[4] = (uint8_t)BDA_ADDRESS_BYTE_4;
           bda_str[5] = (uint8_t)BDA_ADDRESS_BYTE_5;

           printf("Bluetooth Device Address of Speaker/Earbuds is %x:%x:%x:%x:%x:%x \r\n",bda_str[0], bda_str[1], bda_str[2],bda_str[3],bda_str[4],bda_str[5]);

           printf("Skip Bonding Request \r\n");
           /* If the below API is enabled, then a2dp_source_command_connect should be called inside BTM_PAIRING_COMPLETE_EVT */
           /* wiced_bt_dev_sec_bond (bda_str,BLE_ADDR_PUBLIC,BT_TRANSPORT_BR_EDR,0, NULL); */

           a2dp_source_command_connect (bda_str, BD_ADDR_LEN);
           printf("Connection Request sent. Waiting to connect with the BT Speaker/Earbuds ....\r\n");

        } else
        {
            WICED_BT_TRACE("Bluetooth Enable failed \n");
        }
        break;

    case BTM_DISABLED_EVT:
            WICED_BT_TRACE("Bluetooth Disabled \n");
        break;

    case BTM_SECURITY_FAILED_EVT:
        if (p_event_data == NULL)
        {
            WICED_BT_TRACE("Callback data pointer p_event_data is NULL \n");
            break;
        }
        WICED_BT_TRACE("Security failed: %d / %d\n", p_event_data->security_failed.status,
                                                       p_event_data->security_failed.hci_status);
        break;

    case BTM_PIN_REQUEST_EVT:
        if (p_event_data == NULL)
        {
            WICED_BT_TRACE("Callback data pointer p_event_data is NULL \n");
            break;
        }
        WICED_BT_TRACE("remote address= %x\n", p_event_data->pin_request.bd_addr);
        wiced_bt_dev_pin_code_reply(*p_event_data->pin_request.bd_addr, WICED_BT_SUCCESS,
                                                        WICED_PIN_CODE_LEN, (uint8_t *)&pincode[0]);
        break;

    case BTM_USER_CONFIRMATION_REQUEST_EVT:
        if (p_event_data == NULL)
        {
            WICED_BT_TRACE("Callback data pointer p_event_data is NULL \n");
            break;
        }
        /* If this is just works pairing, accept.
         * Otherwise send event to the MCU to confirm the same value.
         */
        WICED_BT_TRACE("User Confirmation. BDA %x, Key %d \n", p_event_data->user_confirmation_request.bd_addr,
                                                   p_event_data->user_confirmation_request.numeric_value);
        wiced_bt_dev_confirm_req_reply( WICED_BT_SUCCESS, p_event_data->user_confirmation_request.bd_addr );
        break;

    case BTM_PASSKEY_NOTIFICATION_EVT:
        if (p_event_data == NULL)
        {
            WICED_BT_TRACE("Callback data pointer p_event_data is NULL \n");
            break;
        }
        WICED_BT_TRACE("PassKey Notification. BDA %x, Key %d \n",
                                   p_event_data->user_passkey_notification.bd_addr,
                                   p_event_data->user_passkey_notification.passkey);
        wiced_bt_dev_confirm_req_reply( WICED_BT_SUCCESS, p_event_data->user_passkey_notification.bd_addr );
        break;

    case BTM_PAIRING_IO_CAPABILITIES_BR_EDR_REQUEST_EVT:
        if (p_event_data == NULL)
        {
            WICED_BT_TRACE("Callback data pointer p_event_data is NULL \n");
            break;
        }
        /* Use the default security for BR/EDR*/
        WICED_BT_TRACE("BTM_PAIRING_IO_CAPABILITIES_BR_EDR_REQUEST_EVT bda %x\n",
                       p_event_data->pairing_io_capabilities_br_edr_request.bd_addr);
        p_event_data->pairing_io_capabilities_br_edr_request.local_io_cap =
                                                        BTM_IO_CAPABILITIES_DISPLAY_AND_YES_NO_INPUT;
        p_event_data->pairing_io_capabilities_br_edr_request.auth_req =
                                                        BTM_AUTH_SINGLE_PROFILE_GENERAL_BONDING_NO;
        p_event_data->pairing_io_capabilities_br_edr_request.oob_data = WICED_FALSE;
        p_event_data->pairing_io_capabilities_br_edr_request.auth_req =
                                                        BTM_AUTH_ALL_PROFILES_NO;
        break;

    case BTM_PAIRING_IO_CAPABILITIES_BLE_REQUEST_EVT:
        if (p_event_data == NULL)
        {
            WICED_BT_TRACE("Callback data pointer p_event_data is NULL \n");
            break;
        }
        /* Use the default security for BLE */
        WICED_BT_TRACE("BTM_PAIRING_IO_CAPABILITIES_BLE_REQUEST_EVT bda %x\n",
                p_event_data->pairing_io_capabilities_ble_request.bd_addr);
        p_event_data->pairing_io_capabilities_ble_request.local_io_cap  =
                                                    BTM_IO_CAPABILITIES_DISPLAY_AND_YES_NO_INPUT;
        p_event_data->pairing_io_capabilities_ble_request.oob_data = BTM_OOB_NONE;
        p_event_data->pairing_io_capabilities_ble_request.auth_req =
                                                    BTM_LE_AUTH_REQ_SC_MITM_BOND;
        p_event_data->pairing_io_capabilities_ble_request.max_key_size  = MAX_KEY_SIZE;
        p_event_data->pairing_io_capabilities_ble_request.init_keys =
                                                    BTM_LE_KEY_PENC|BTM_LE_KEY_PID|BTM_LE_KEY_PCSRK|BTM_LE_KEY_LENC;
        p_event_data->pairing_io_capabilities_ble_request.resp_keys =
                                                    BTM_LE_KEY_PENC|BTM_LE_KEY_PID|BTM_LE_KEY_PCSRK|BTM_LE_KEY_LENC;
        break;

    case BTM_PAIRING_COMPLETE_EVT:
        if (p_event_data == NULL)
        {
            WICED_BT_TRACE("Callback data pointer p_event_data is NULL \n");
            break;
        }
        p_pairing_cmpl = &p_event_data->pairing_complete;
        if(p_pairing_cmpl->transport == BT_TRANSPORT_BR_EDR)
        {
            pairing_result = p_pairing_cmpl->pairing_complete_info.br_edr.status;
        }
        else
        {
            pairing_result = p_pairing_cmpl->pairing_complete_info.ble.reason;
        }
        WICED_BT_TRACE( "Pairing Result: %d\n", pairing_result );


        bda_str[0] = (uint8_t)BDA_ADDRESS_BYTE_0;
        bda_str[1] = (uint8_t)BDA_ADDRESS_BYTE_1;
        bda_str[2] = (uint8_t)BDA_ADDRESS_BYTE_2;
        bda_str[3] = (uint8_t)BDA_ADDRESS_BYTE_3;
        bda_str[4] = (uint8_t)BDA_ADDRESS_BYTE_4;
        bda_str[5] = (uint8_t)BDA_ADDRESS_BYTE_5;

