Infineon/cce-mtb-psoc6-bt-a2dp-source/source/source_bluetooth/a2dp_source.c
        // Enable here if bonding request API is called so that connection happens after pairing.
        //a2dp_source_command_connect (bda_str, BD_ADDR_LEN);
        break;

    case BTM_ENCRYPTION_STATUS_EVT:
        if (p_event_data == NULL)
        {
            WICED_BT_TRACE("Callback data pointer p_event_data is NULL \n");
            break;
        }
        p_encryption_status = &p_event_data->encryption_status;
        WICED_BT_TRACE( "Encryption Status:(%x) res:%d\n", p_encryption_status->bd_addr,
                                                           p_encryption_status->result );
        break;

    case BTM_SECURITY_REQUEST_EVT:
        if (p_event_data == NULL)
        {
            WICED_BT_TRACE("Callback data pointer p_event_data is NULL \n");
            break;
        }
        WICED_BT_TRACE( "Security Request Event \n");
        wiced_bt_ble_security_grant( p_event_data->security_request.bd_addr, WICED_BT_SUCCESS );
        break;

    case BTM_PAIRED_DEVICE_LINK_KEYS_UPDATE_EVT:
        if (p_event_data == NULL)
        {
            WICED_BT_TRACE("Callback data pointer p_event_data is NULL \n");
            break;
        }
        WICED_BT_TRACE("BTM_PAIRED_DEVICE_LINK_KEYS_UPDATE_EVT - dev: [%x]  Len:%d\n",
                             p_event_data->paired_device_link_keys_update.bd_addr,
                             sizeof(wiced_bt_device_link_keys_t));

        /* This application supports a single paired host, we can save keys
         * under the same NVRAM ID overwriting previous pairing if any */
        a2dp_source_write_nvram(A2DP_SOURCE_NVRAM_ID,
                sizeof(wiced_bt_device_link_keys_t), &p_event_data->paired_device_link_keys_update);

         break;

    case BTM_PAIRED_DEVICE_LINK_KEYS_REQUEST_EVT:
        if (p_event_data == NULL)
        {
            WICED_BT_TRACE("Callback data pointer p_event_data is NULL \n");
            break;
        }
        WICED_BT_TRACE("BTM_PAIRED_DEVICE_LINK_KEYS_REQUEST_EVT - dev: [%x]  Len:%d \r\n",
                            p_event_data->paired_device_link_keys_request.bd_addr,
                            sizeof(wiced_bt_device_link_keys_t));
        printf("\r\nLink key request - %x:%x:%x:%x:%x:%x\r\n",p_event_data->paired_device_link_keys_request.bd_addr[0], p_event_data->paired_device_link_keys_request.bd_addr[1], p_event_data->paired_device_link_keys_request.bd_addr[2],p_event_data->paired_device_link_keys_request.bd_addr[3],p_event_data->paired_device_link_keys_request.bd_addr[4],p_event_data->paired_device_link_keys_request.bd_addr[5]);

        /* read existing key from the NVRAM  */
        if (a2dp_source_read_nvram (A2DP_SOURCE_NVRAM_ID,
                  &p_event_data->paired_device_link_keys_request,
                  sizeof(wiced_bt_device_link_keys_t)) != 0)
        {
            result = WICED_BT_SUCCESS;
        }
        else
        {
            result = WICED_BT_ERROR;
            WICED_BT_TRACE ("Key retrieval failure\n");
        }
        break;

    case BTM_LOCAL_IDENTITY_KEYS_UPDATE_EVT:
        if (p_event_data == NULL)
        {
            WICED_BT_TRACE("Callback data pointer p_event_data is NULL \n");
            break;
        }
        /* save keys to NVRAM */
        //p_keys = (uint8_t*) &p_event_data->local_identity_keys_update;
        WICED_BT_TRACE("  result: %d \n", result);
        break;

    case BTM_LOCAL_IDENTITY_KEYS_REQUEST_EVT:
        if (p_event_data == NULL)
        {
            WICED_BT_TRACE("Callback data pointer p_event_data is NULL \n");
            break;
        }
        /* read keys from NVRAM */
        //p_keys = (uint8_t*) &p_event_data->local_identity_keys_request;
        break;

    case BTM_POWER_MANAGEMENT_STATUS_EVT:
        if (p_event_data == NULL)
        {
            WICED_BT_TRACE("Callback data pointer p_event_data is NULL \n");
            break;
        }
        p_power_mgmt_notification = &p_event_data->power_mgmt_notification;
        WICED_BT_TRACE( "Power mgmt status event: bd ( %x ) status:%d hci_status:%d\n",
                        p_power_mgmt_notification->bd_addr, p_power_mgmt_notification->status,
                        p_power_mgmt_notification->hci_status);
        break;

    case BTM_BLE_ADVERT_STATE_CHANGED_EVT:
        if (p_event_data == NULL)
        {
            WICED_BT_TRACE("Callback data pointer p_event_data is NULL \n");
            break;
        }
        p_mode = &p_event_data->ble_advert_state_changed;
        WICED_BT_TRACE( "Advertisement State Change: %d\n", *p_mode);
        break;

    case BTM_BLE_CONNECTION_PARAM_UPDATE:
        if (p_event_data == NULL)
        {
            WICED_BT_TRACE("Callback data pointer p_event_data is NULL \n");
            break;
        }
        /* Connection parameters updated */
        if (WICED_SUCCESS == p_event_data->ble_connection_param_update.status)
        {
            WICED_BT_TRACE("Supervision Time Out = %d\n",
                    (p_event_data->ble_connection_param_update.supervision_timeout * 10));
        }
        break;

    default:
        WICED_BT_TRACE("Unhandled Bluetooth Management Event: 0x%x %s\n", event, get_bt_event_name(event));
        break;
    }
    return result;
}

/*******************************************************************************
* Function Name: gpio_interrupt_handler
********************************************************************************
* Summary:
*   GPIO interrupt handler.
*
* Parameters:
*  void *handler_arg (unused)
*  cyhal_gpio_event_t (unused)
*
*******************************************************************************/

static void gpio_interrupt_handler(void *handler_arg, cyhal_gpio_event_t event)
{
    status_flag = 1;
    if (bStreamingActive == WICED_FALSE)
    {
        bStreamingActive = WICED_TRUE;
    } else if (bStreamingActive == WICED_TRUE)
    {
        bStreamingActive = WICED_FALSE;
    }
}

/* [] END OF FILE */
